import styles from './profile.module.scss';

import cn from 'classnames';

import {
  Modal,
  ModalOverlay,
  ModalContent,
  ModalHeader,
  ModalBody,
  useDisclosure
} from '@chakra-ui/react';

import { useState } from 'react';
import { Link } from 'react-router-dom';
import { FaClipboardList } from 'react-icons/fa';

export const UserAgreementModal: React.FC = () => {
  const { isOpen, onOpen, onClose } = useDisclosure();
  const [scrollBehavior, setScrollBehavior] = useState('inside');

  return (
    <div>
      <Link
        to="#"
        onClick={() => {
          onOpen();
        }}
        className={cn(styles.content__item, styles.item)}
      >
        <span>
          <FaClipboardList />
        </span>
        <div className={styles.item__descr}>
          <h4 className={styles.item__title}>Користувацька угода</h4>
          <div className={styles.item__text}>Сторінка з користувацькою угодою</div>
        </div>
      </Link>

      <Modal
        isOpen={isOpen}
        onClose={onClose}
        scrollBehavior={scrollBehavior}
        isCentered
        size={'full'}
      >
        <ModalOverlay bg="none" backdropFilter="auto" backdropBlur="3px" />
        <ModalContent className={styles.modal}>
          <ModalHeader className={styles.modal__header}>Користувацька угода</ModalHeader>
          <ModalBody className={styles.modal__body}>
            <div className={styles.modal__agreement}>
              <h2>ПРАВИЛА КОРИСТУВАННЯ ТА УГОДА КОРИСТУВАЧА</h2>
              <br />
              <h3>1. Визначення понять та основні положення</h3>
              <br />
              <p>
                1.1. <span>Сервіс</span> – комп’ютерна програма «Офіційні тести ПДР України» для
                навчання правилам дорожнього руху, а також проходження пробного тестування перед
                іспитами.
              </p>
              <br />
              <p>Складові Сервісу:</p>
              <br />
              <ul className={styles.bullet_list}>
                <li>Додаток для Android</li>
                <li>Додаток для iOS</li>
                <li>Веб сайт</li>
              </ul>
              <br />
              <p>
                1.2. <span>Користувач або Ви</span> – особа, яка використовує Сервіс.
              </p>
              <br />
              <p>
                1.4. <span>Продавець</span> – Державне підприємство «Інфотех», яке розповсюджує
                Сервіс та пропонує придбати розширений функціонал Сервісу на умовах, визначених
                Сервісом та цими Правилами.
              </p>
              <br />
              <p>
                1.5. Для використання Сервісу Користувачу необхідно пройти процедуру реєстрації за
                допомогою будь-якої Складової Сервісу або пройти процедуру авторизації
                використовуючи акаунт соціальних мереж.
              </p>
              <br />
              <p>
                1.6. Процедура реєстрації/авторизації завершується генерацією логіна та пароля
                Користувача.
              </p>
              <br />
              <p>
                1.7. За допомогою створеного логіна та пароля Користувач може здійснювати
                авторизацію до Сервісу використовуючи будь-яку його складову.
              </p>
              <br />
              <p>
                1.8. Завантажуючи Сервіс, реєструючись або вперше авторизуючись в Сервісі Ви
                приєднуєтеся до цих Правил в цілому та зобов’язуйтеся дотримуватися їх умов, та у
                зв’язку з чим не можете запропонувати свої власні умови.
              </p>
              <br />
              <p>1.9. Умови цих Правил однакові для всіх Користувачів.</p>
              <br />
              <h3>2. Дозвіл на використання(Ліцензія)</h3>
              <br />
              <p>
                2.1. Усі права інтелектуальної власності на Сервіс захищено. Сервіс охороняється
                законодавством про авторські права, міжнародними угодами та конвенціями у сфері
                інтелектуальної власності й іншими нормативно-правовими актам.
              </p>
              <br />
              <p>
                2.2. Користувачу надається невиключне, непередаване, обмежене право використовувати
                Сервіс за функціональним призначенням (невиключна ліцензія кінцевого користувача),
                протягом необмеженого строку на території всього світу. Платний функціонал Сервісу
                діє протягом оплаченого періоду.
              </p>
              <br />
              <p>
                2.3. Ніщо в цих Правилах не повинно тлумачитися таким чином, що надає Вам будь-які
                права, крім невиключної ліцензії кінцевого користувача, наданої відповідно до
                наведеного вище.
              </p>
              <br />
              <p>
                2.4. Вам заборонено здійснювати наступні дії з Сервісом: здавати в оренду, позичати,
                продавати або видавати субліцензії. Вам заборонено отримувати доступ Сервісу за
                допомогою інших засобів, крім Складових Сервісу, видобувати або витягувати будь-які
                дані з Сервісу, змінювати, здійснювати зворотне проектування, зламувати, декодувати,
                декомпілювати, розбирати або створювати похідні продукти на основі Сервісу або
                будь-якої його частини, та обходити будь-яку технологію, що використовується для
                захисту функцій Сервісу. Якщо інше не було прямо встановлено правовласником, Вам
                заборонено поширювати будь-які знімки екранів, зміст або опис Сервісу або будь-які
                його частини
              </p>
              <br />
              <p>
                2.5. Сервіс та/або його частини можуть містити об’єкти інтелектуальної власності
                третіх осіб, які ліцензуються окремо або правила використання яких встановлюються їх
                правовласниками.
              </p>
              <br />
              <h3>3. Функціональні можливості Сервісу, оновлення та підтримка</h3>
              <br />
              <p>3.1. Сервіс надає Вам такі можливості:</p>
              <br />
              <ul>
                <li>
                  <p>
                    a) ознайомлення з теоретичною інформацією по правилам дорожнього руху (ПДР),
                    дорожнім знакам, дорожньої розмітки, знаків регулювальника і сигналам
                    світлофора;
                  </p>
                </li>
                <br />
                <li>
                  <p>
                    b) навчання за темами – відповіді на питання, які стосуються конкретних тем
                    правил дорожнього руху;
                  </p>
                </li>
                <br />
                <li>
                  <p>
                    c) навчання за квитками – проходження квитків складаються з 20-ти питань без
                    обмеження за часом і кількістю допущених помилок;
                  </p>
                </li>
                <br />
                <li>
                  <p>
                    d) проходження іспиту – проходження квитка з обмеженнями, згідно з вимогами
                    Головного сервісного центру МВС.
                  </p>
                </li>
                <br />
              </ul>
              <p>
                3.2. На різних етапах використання Сервісу Користувачам доступні різні функціональні
                можливості
              </p>
              <br />
              <p>
                3.2.1. При запуску Сервісу або при першому його використанні, Користувачу необхідно
                пройти процедуру реєстрації або авторизації. Користувач може
                зареєструватися/авторизуватися використовуючи: e-mail та пароль або дані Facebook,
                Google, Apple ID акаунтів.
              </p>
              <br />
              <p>3.2.2. Після реєстрації/авторизації Користувачу доступна можливість:</p>
              <br />
              <ul>
                <li>
                  <p>a) переглядати теорію;</p>
                </li>
                <br />
                <li>
                  <p>b) редагувати свій профіль;</p>
                </li>
                <br />
                <li>
                  <p>c) проходити іспит «як в сервісному центрі»;</p>
                </li>
                <br />
                <li>
                  <p>d) придбати преміум підписку (розширення функціонала);</p>
                </li>
                <br />
                <li>
                  <p>
                    e) після придбання преміум підписки (розширення функціонала)Користувачеві стає
                    доступний додатковий набір функціональності: вчити по квитках, вчити по темам,
                    часті помилки, підключення до групи.
                  </p>
                </li>
                <br />
              </ul>
              <p>3.3. Рекомендовані технічні вимоги до обладнання/пристроїв Користувача:</p>
              <br />
              <ul>
                <li>
                  <p>
                    a) Додаток для Android: наявність пристрою з підтримуваною версією операційної
                    системи Andoid версії 6.0 та вище;
                  </p>
                </li>
                <br />
                <li>
                  <p>
                    b) Додаток для iOS: наявність пристрою з підтримуваною версією операційної
                    системи іOS версії 9.0 та вище;
                  </p>
                </li>
                <br />
                <li>
                  <p>
                    c) Вебсайт: наявність стабільного підключення до мережі інтернет, наявність
                    актуальної версії веббраузера Chrome, FireFox, Safari чи Opera.
                  </p>
                </li>
                <br />
                <p>
                  3.4. Для підтримки Сервісу в робочому стані необхідно стежити за оновленнями
                  Сервісу, які публікуються на платформах GooglePlay і AppStore.
                </p>
                <br />
              </ul>
              <p>3.5. Користувачам вебсайту завжди доступна актуальна версія Сервісу.</p>
              <br />
              <p>
                3.6. Сервіс постійно вдосконалюється, і його правовласники залишають за собою право
                на власний розсуд оновлювати Сервіс, змінювати характер Сервісу, змінювати або
                припиняти деякі його функції без попереднього повідомлення.
              </p>
              <br />
              <p>
                3.7. Ви погоджуєтесь з тим, що Продавець не зобов'язаний здійснювати підтримку або
                оновлення Сервісу. Продавець не гарантує безперебійного надання послуг або
                відсутності будь-яких помилок, «багів» або неточностей. Сервіс може бути тимчасово
                недоступний через технічне обслуговування, певні технічні труднощі або інші події,
                які не залежать від Продавця. Якщо у Вас виникли питання, проблеми або пропозиції,
                Ви можете зв'язатися з Продавцем за контактами, вказаними в цих Правилах. Однак Ви
                погоджуєтесь з тим, що підтримка Сервісу може бути обмеженою у зв'язку з обмеженими
                ресурсами Продавця або правовласників.
              </p>
              <br />
              <h3>4.Платежі та підписки</h3>
              <br />
              <p>
                4.1. Оплата преміум підписки (розширення функціонала) на Сервіс здійснюється авансом
                у розмірі 100% від вартості підписки.
              </p>
              <br />
              <p>
                4.2. Придбаний розширений функціонал за преміум підпискою буде доступний Користувачу
                відразу після проведення платежу, на строк оплаченої підписки.
              </p>
              <br />
              <p>
                4.3. Послуга з розширення функціонала Сервісу за преміум підпискою надається відразу
                після проведення платежу.
              </p>
              <br />
              <p>
                4.4. Повернення сплачених коштів відбувається за правилами, визначеними чинним
                законодавством України, цими правилами, умовами Google Play та App Store.
              </p>
              <br />
              <p>
                4.5. Для повернення коштів, сплачених через Веб сайт (далі - Веб сайт) необхідно
                надіслати запит на повернення на адресу info@infotech.gov.ua та протягом 14 днів з
                дати покупки підписки.
              </p>
              <p>
                4.6. Ми розглянемо Ваше звернення у 30 денний строк, у разі схвалення повернення,
                сплачені грошові кошти за купівлю підписки через Веб сайт будуть повернуті особі,
                яка здійснила покупку на вказаний нею рахунок.
              </p>
              <br />
              <p>
                4.7. Повернення коштів, сплачених через Google Play або App Store, відбувається за
                правилами цих платформ, на які Продавець не впливає.
              </p>
              <br />
              <h3>5. Відповідальність,ризики та обмеження відповідальності</h3>
              <br />
              <p>
                5.1. Користувач особисто відповідає за використання власного акаунта, за допомогою
                якого здійснюється доступ (авторизація) до Сервісу.
              </p>
              <br />
              <p>
                5.2. Продавець та/або будь-які треті особи не несуть відповідальність за
                використання акаунта Користувача. Якщо Ви вважаєте, що конфіденційність Ваших
                авторизаційних даних було скомпрометовано або порушено, Ви повинні негайно
                сповістити про це Продавця, використовуючи форму технічної підтримки.
              </p>
              <br />
              <p>
                5.3. Ви прямо підтверджуєте і погоджуєтеся з тим, що використання Сервісу
                здійснюється виключно на ваш ризик, і тому усі ризики, зокрема щодо задовільної
                якості, робочих характеристик і придатності для конкретної мети, несете виключно Ви.
              </p>
              <br />
              <p>
                5.4. Сервіс надається за принципом «як є» (as is) та може не відповідати Вашим
                очікуванням. Ми не можемо гарантувати: 100% безперебійну роботу Сервісу та
                доступність його функціональності 24/7, що Сервіс і будь-які його функції або
                послуги будуть працювати безперебійно, без помилок, захищено, всеосяжно, у повному
                обсязі, точно або в актуальному обсязі, а також, що всі помилки в Сервісі може бути
                знайдено або виправлено.
              </p>
              <br />
              <p>
                5.5. У максимально можливому обсязі, дозволеному законом, Продавець в жодному разі
                не несе відповідальності за будь-які прямі або непрямі збитки, втрати, включаючи,
                втрату можливості використання, втрату даних, прибутку, матеріальні збитки або інші
                нематеріальні або економічні втрати, що виникли внаслідок або у зв'язку з Вашим
                використанням або неможливістю використання Сервісу, незалежно від причини.
              </p>
              <br />
              <h3>6. Сторонні продукти</h3>
              <br />
              <p>
                6.1. В Сервіс можуть інтегруватися або іншим чином включатися сторонні продукти
                (наприклад, платіжні сервіси). Ви підтверджуєте, що крім цих Правил до Вас можуть
                застосовуватися умови користування сторонніми продуктами (включаючи їх політики
                конфіденційності), і що Продавець не гарантує доступності та якості таких послуг. Ви
                зобов'язані погодитися та дотримуватися будь-яких застосовних умов третіх осіб (у
                тому числі умов оплати) та інших процедур (таких як ідентифікація та верифікація)
                при використанні Сервісу.
              </p>
              <br />
              <h3>7. Обробка персональних даних </h3>
              <br />
              <p>
                7.1. Всю інформацію про обсяг і спосіб обробки Ваших персональних даних, включено до
                «Повідомлення про обробку персональних даних", що розміщено за посиланням
              </p>
              <br />
              <h3>8. Вирішення спорів</h3>
              <br />
              <p>
                8.1. Всі спори вирішуються шляхом переговорів, у разі не можливості врегулювати спір
                шляхом переговорів, спір вирішується в судовому порядку.
              </p>
              <br />
              <h3>9. Строк дії та припинення </h3>
              <br />
              <p>
                9.1. Ці Правила діють з моменту їх прийняття (акцепту) та до моменту припинення
                використання Сервісу Вами. Таким припиненням вважається видалення мобільного додатка
                з вашого пристрою, запит на видалення акаунта або Ваших даних з бази даних Сервісу.
              </p>
              <br />
              <p>
                9.2. Продавець в односторонньому порядку може розірвати правовідносини з Вами в
                будь-який час і з будь-якої причини за умови попереднього завчасно повідомлення Вас
                будь-яким шляхом.
              </p>
              <br />
              <h3>10. Інші умови та контактна інформація </h3>
              <br />
              <p>
                10.1. Ми можемо час від часу оновлювати ці Правила, таким чином, рекомендуємо
                періодично переглядати цю сторінку. Звичайно, ми повідомимо Вас про будь-які зміни,
                опублікувавши нову редакцію Правил тут.
              </p>
              <br />
              <p>10.2. Ці Правила діють з 01.10.2021.</p>
              <br />
              <p>10.3. Зв'яжіться з нами з будь-яких питань</p>
            </div>
          </ModalBody>
        </ModalContent>
      </Modal>
    </div>
  );
};
